Revit 2027 API
BindingMap.ReInsert(Definition, Binding) Method
Removes an existing parameter and creates a new binding for a given parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool ReInsert(
	Definition key,
	Binding item
)
Public Overridable Function ReInsert (
	key As Definition,
	item As Binding
) As Boolean
public:
virtual bool ReInsert(
	Definition^ key,
	Binding^ item
)
abstract ReInsert :
        key : Definition *
        item : Binding -> bool
override ReInsert :
        key : Definition *
        item : Binding -> bool
Parameters
key Definition
A parameter definition which can be an existing definition or one from a shared parameters file.
item Binding
An InstanceBinding or TypeBinding object which contains the set of categories to which the parameter should be bound.
Return Value
Boolean
Remarks
Note the type of the binding object dictates whether the parameter is bound to all instances or just types. A parameter definition cannot be bound to both instances and types. If the parameter binding already exists, remove the binding, create a new parameter binding.
See Also
Reference
BindingMap Class
ReInsert Overload
Autodesk.Revit.DB Namespace